<?xml version="1.0" ?>
<net batch="1" name="arcface" version="6">
	<layers>
		<layer id="0" name="input_1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>200</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="1728"/>
				<biases offset="1728" size="64"/>
			</blobs>
		</layer>
		<layer id="2" name="activation_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2d_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1792" size="9216"/>
				<biases offset="11008" size="64"/>
			</blobs>
		</layer>
		<layer id="4" name="activation_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="max_pooling2d_1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>16</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2d_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>16</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11072" size="18432"/>
				<biases offset="29504" size="128"/>
			</blobs>
		</layer>
		<layer id="7" name="activation_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2d_4/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</output>
			<blobs>
				<weights offset="29632" size="36864"/>
				<biases offset="66496" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="activation_4/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="max_pooling2d_2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>32</dim>
					<dim>53</dim>
					<dim>53</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_5/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="38" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="66624" size="43776"/>
				<biases offset="110400" size="152"/>
			</blobs>
		</layer>
		<layer id="12" name="activation_5/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2d_6/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="38" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="110552" size="51984"/>
				<biases offset="162536" size="152"/>
			</blobs>
		</layer>
		<layer id="14" name="activation_6/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2d_7/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="38" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="162688" size="51984"/>
				<biases offset="214672" size="152"/>
			</blobs>
		</layer>
		<layer id="16" name="activation_7/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2d_8/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="38" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
			<blobs>
				<weights offset="214824" size="51984"/>
				<biases offset="266808" size="152"/>
			</blobs>
		</layer>
		<layer id="18" name="activation_8/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="max_pooling2d_3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>38</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2d_9/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="40" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>38</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<weights offset="266960" size="54720"/>
				<biases offset="321680" size="160"/>
			</blobs>
		</layer>
		<layer id="21" name="activation_9/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv2d_10/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="40" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<weights offset="321840" size="57600"/>
				<biases offset="379440" size="160"/>
			</blobs>
		</layer>
		<layer id="23" name="activation_10/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="average_pooling2d_1/AvgPool" precision="FP32" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="3,3"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="average_pooling2d_1/AvgPool/Transpose" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="flatten_1/stack_2404/Concat_/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="379600" size="8"/>
			</blobs>
		</layer>
		<layer id="27" name="flatten_1/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>200</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="dense_1/MatMul" precision="FP32" type="FullyConnected">
			<data out-size="5"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<weights offset="379608" size="800"/>
				<biases offset="380408" size="20"/>
			</blobs>
		</layer>
		<layer id="29" name="batch_normalization_11/cond/Merge/reciprocal_" precision="FP32" type="PNORM">
			<data power="-1" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="batch_normalization_11/cond/Merge/Reshape_Dim11611_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="380428" size="12"/>
			</blobs>
		</layer>
		<layer id="31" name="batch_normalization_11/cond/Merge/Reshape_Node1" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="batch_normalization_11/cond/Merge/Mul_0" precision="FP32" type="Power">
			<data power="1" scale="0.99" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="batch_normalization_11/cond/Merge/Exp_1" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="batch_normalization_11/cond/Merge/Mul_Div_0" precision="FP32" type="Power">
			<data power="1" scale="1.0101010101010102" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="batch_normalization_11/cond/Merge/Mul_1" precision="FP32" type="Power">
			<data power="1" scale="0.9801" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="batch_normalization_11/cond/Merge/Exp_2" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="batch_normalization_11/cond/Merge/Mul_Div_1" precision="FP32" type="Power">
			<data power="1" scale="1.0203040506070808" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="batch_normalization_11/cond/Merge/Mul_2" precision="FP32" type="Power">
			<data power="1" scale="0.970299" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="batch_normalization_11/cond/Merge/Exp_3" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="batch_normalization_11/cond/Merge/Mul_Div_2" precision="FP32" type="Power">
			<data power="1" scale="1.0306101521283646" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="batch_normalization_11/cond/Merge/Mul_3" precision="FP32" type="Power">
			<data power="1" scale="0.96059601" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="batch_normalization_11/cond/Merge/Exp_4" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="batch_normalization_11/cond/Merge/Mul_Div_3" precision="FP32" type="Power">
			<data power="1" scale="1.0410203556852167" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="batch_normalization_11/cond/Merge/Mul_4" precision="FP32" type="Power">
			<data power="1" scale="0.9509900498999999" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="batch_normalization_11/cond/Merge/Exp_5" precision="FP32" type="Activation">
			<data type="exp"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="batch_normalization_11/cond/Merge/Mul_Div_4" precision="FP32" type="Power">
			<data power="1" scale="1.0515357128133502" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="batch_normalization_11/cond/Merge/Concat_" precision="FP32" type="Concat">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>5</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="3660_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="380440" size="16"/>
			</blobs>
		</layer>
		<layer id="49" name="batch_normalization_11/cond/Merge/_pnorm_reduced_sum/Reshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>5</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="batch_normalization_11/cond/Merge/_pnorm_reduced_sum/Pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel="5,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="3662_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="380428" size="12"/>
			</blobs>
		</layer>
		<layer id="52" name="batch_normalization_11/cond/Merge/_pnorm_reduced_sum/FinalReshape" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1000</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="batch_normalization_11/cond/Merge/Reshape_Dim1671_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="380456" size="8"/>
			</blobs>
		</layer>
		<layer id="54" name="batch_normalization_11/cond/Merge/Reshape_Node" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>5</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>200</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="1"/>
		<edge from-layer="27" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="3" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="47" to-port="1"/>
		<edge from-layer="40" from-port="1" to-layer="47" to-port="2"/>
		<edge from-layer="43" from-port="1" to-layer="47" to-port="3"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="4"/>
		<edge from-layer="47" from-port="5" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="1" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="52" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="52" to-port="1"/>
		<edge from-layer="52" from-port="2" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="1" to-layer="54" to-port="1"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input value="input_1"/>
			<input_model value="DIR/arcface.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[200,160,160,3]"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="DEBUG"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output value="['batch_normalization_11/cond/Merge']"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="{'input_1': array([200, 160, 160,   3])}"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<tensorflow_object_detection_api_pipeline_config value="DIR/pipeline.config"/>
			<tensorflow_use_custom_operations_config value="DIR/operations.json"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input_checkpoint, input_meta_graph, model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_operation_patterns, tensorflow_subgraph_patterns"/>
		</cli_parameters>
	</meta_data>
</net>
