<?xml version="1.0" ?>
<net batch="1" name="optical_flow" version="6">
	<layers>
		<layer id="0" name="depth_map" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="14091410_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="2" name="Gather_1" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_1/Squeeze/axis1414_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="4" name="Gather_1/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_2" precision="FP32" type="Permute">
			<data order="1,2,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>240</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_3/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>240</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4" size="921600"/>
			</blobs>
		</layer>
		<layer id="7" name="Mul_4" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>240</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_6/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>240</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="921604" size="307200"/>
			</blobs>
		</layer>
		<layer id="9" name="Concat_7" precision="FP32" type="Concat">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>240</dim>
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>240</dim>
					<dim>320</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_8/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228804" size="8"/>
			</blobs>
		</layer>
		<layer id="11" name="Reshape_9" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>320</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="MatMul_12" precision="FP32" type="FullyConnected">
			<data out-size="4.0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1228812" size="64"/>
			</blobs>
		</layer>
		<layer id="13" name="MatMul_19" precision="FP32" type="FullyConnected">
			<data out-size="4.0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1228876" size="64"/>
			</blobs>
		</layer>
		<layer id="14" name="Transpose_20" precision="FP32" type="Permute">
			<data order="1,0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="14631464_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="16" name="Gather_48" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Gather_48/Squeeze/axis1468_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="18" name="Gather_48/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="14691470_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="Gather_50" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Gather_50/Squeeze/axis1474_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="22" name="Gather_50/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul_51" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Div_52/reciprocal_" precision="FP32" type="Power">
			<data power="-1.0" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="MatMul_15" precision="FP32" type="FullyConnected">
			<data out-size="4.0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1228944" size="64"/>
			</blobs>
		</layer>
		<layer id="26" name="Transpose_16" precision="FP32" type="Permute">
			<data order="1,0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="14271428_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="28" name="Gather_27" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Gather_27/Squeeze/axis1432_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="30" name="Gather_27/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="14331434_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="32" name="Gather_29" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Gather_29/Squeeze/axis1438_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="34" name="Gather_29/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Mul_30" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Sub_31/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="14151416_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="Gather_22" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Gather_22/Squeeze/axis1420_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="Gather_22/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="14211422_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="42" name="Gather_24" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Gather_24/Squeeze/axis1426_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="44" name="Gather_24/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Mul_25" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Sub_31/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Mul_33" precision="FP32" type="Power">
			<data power="1" scale="277.1281292110204" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Div_52/mul_" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Div_60/mul_" precision="FP32" type="Power">
			<data power="1" scale="60.0" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_63/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1229008" size="8"/>
			</blobs>
		</layer>
		<layer id="51" name="Reshape_64" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="14751476_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="53" name="Gather_54" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Gather_54/Squeeze/axis1480_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="Gather_54/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="14811482_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="57" name="Gather_56" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Gather_56/Squeeze/axis1486_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="59" name="Gather_56/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Mul_57" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Div_58/reciprocal_" precision="FP32" type="Power">
			<data power="-1.0" scale="1" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="14511452_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="63" name="Gather_40" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Gather_40/Squeeze/axis1456_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="65" name="Gather_40/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="14571458_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1229016" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="Gather_42" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Gather_42/Squeeze/axis1462_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="69" name="Gather_42/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Mul_43" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Sub_44/negate_" precision="FP32" type="Power">
			<data power="1" scale="-1" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="14391440_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1229016" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="Gather_35" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Gather_35/Squeeze/axis1444_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="Gather_35/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="14451446_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1228940" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="Gather_37" precision="FP32" type="Gather">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Gather_37/Squeeze/axis1450_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="79" name="Gather_37/Squeeze" precision="FP32" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Mul_38" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Sub_44/add_" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul_46" precision="FP32" type="Power">
			<data power="1" scale="289.7056274847714" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Div_58/mul_" precision="FP32" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Div_62/mul_" precision="FP32" type="Power">
			<data power="1" scale="60.0" shift="0"/>
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>76800</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_65/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1229008" size="8"/>
			</blobs>
		</layer>
		<layer id="86" name="Reshape_66" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>76800</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_67" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>76800</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>76800</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_68/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1229020" size="12"/>
			</blobs>
		</layer>
		<layer id="89" name="Reshape_69" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>76800</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>240</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="12" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="34" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="2" to-layer="35" to-port="1"/>
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="44" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="44" from-port="2" to-layer="45" to-port="1"/>
		<edge from-layer="36" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="45" from-port="2" to-layer="46" to-port="1"/>
		<edge from-layer="46" from-port="2" to-layer="47" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="51" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="53" to-port="1"/>
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="57" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="57" to-port="1"/>
		<edge from-layer="57" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="1" to-layer="59" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="59" from-port="2" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="63" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="65" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="65" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="67" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="67" to-port="1"/>
		<edge from-layer="67" from-port="2" to-layer="69" to-port="0"/>
		<edge from-layer="68" from-port="1" to-layer="69" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="70" to-port="0"/>
		<edge from-layer="69" from-port="2" to-layer="70" to-port="1"/>
		<edge from-layer="70" from-port="2" to-layer="71" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="73" to-port="0"/>
		<edge from-layer="72" from-port="1" to-layer="73" to-port="1"/>
		<edge from-layer="73" from-port="2" to-layer="75" to-port="0"/>
		<edge from-layer="74" from-port="1" to-layer="75" to-port="1"/>
		<edge from-layer="14" from-port="1" to-layer="77" to-port="0"/>
		<edge from-layer="76" from-port="1" to-layer="77" to-port="1"/>
		<edge from-layer="77" from-port="2" to-layer="79" to-port="0"/>
		<edge from-layer="78" from-port="1" to-layer="79" to-port="1"/>
		<edge from-layer="75" from-port="2" to-layer="80" to-port="0"/>
		<edge from-layer="79" from-port="2" to-layer="80" to-port="1"/>
		<edge from-layer="71" from-port="1" to-layer="81" to-port="0"/>
		<edge from-layer="80" from-port="2" to-layer="81" to-port="1"/>
		<edge from-layer="81" from-port="2" to-layer="82" to-port="0"/>
		<edge from-layer="61" from-port="1" to-layer="83" to-port="0"/>
		<edge from-layer="82" from-port="1" to-layer="83" to-port="1"/>
		<edge from-layer="83" from-port="2" to-layer="84" to-port="0"/>
		<edge from-layer="84" from-port="1" to-layer="86" to-port="0"/>
		<edge from-layer="85" from-port="1" to-layer="86" to-port="1"/>
		<edge from-layer="51" from-port="2" to-layer="87" to-port="0"/>
		<edge from-layer="86" from-port="2" to-layer="87" to-port="1"/>
		<edge from-layer="87" from-port="2" to-layer="89" to-port="0"/>
		<edge from-layer="88" from-port="1" to-layer="89" to-port="1"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<data_type value="float"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/optical_flow.onnx"/>
			<input_shape value="[1,1,240,320]"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="DEBUG"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[  1   1 240 320]"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, model_name, output, scale"/>
		</cli_parameters>
	</meta_data>
</net>
